# IsEqual Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorSettings..::..IsEqual Method
AnalysisDisplayColorSettings Class See Also
---
Compares two color settings objects.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsEqual(
	AnalysisDisplayColorSettings other
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	other As AnalysisDisplayColorSettings _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	AnalysisDisplayColorSettings^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Analysis..::..AnalysisDisplayColorSettings Color settings object to compare to.
# ### Return Value
True if objects are equal, false otherwise.
# See Also
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace